DataProcessors/ИА_УстановкаУровнейДоступаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ИА_УстановкаУровнейДоступаПользователей</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>КодыРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Серии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Серии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доступно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыИнструкции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипИнструкции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ТипыИнструкций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доступно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Статусы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_СтатусИнструкции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доступно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ИА_УровниДоступаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_УровниДоступаПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ТипыИнструкций</v8:Type>
						<v8:Type>cfg:EnumRef.ИА_СтатусИнструкции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИА_Серии</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ИА_СтатусИнструкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_СтатусИнструкции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДействует</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ИА_УстановкаУровнейДоступаПользователей/Forms/ФормаУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	Элементы.Пользователи.Обновить();
	Модифицированность = Ложь;
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	Если не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат;
	КонецЕсли;
	
	// сохраним доступные объекты
	набор = РегистрыСведений.ИА_УровниДоступаПользователей.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Значение = Пользователь;
	Набор.Отбор.Пользователь.Использование = Истина;
	Набор.Прочитать();
	Набор.Очистить();
	
	Если Администратор Тогда
		Новстр = Набор.Добавить();
		Новстр.Пользователь = Пользователь;
		Новстр.ОбъектДоступа = Справочники.ОргСхема.ПустаяСсылка();
	КонецЕсли;
	
	Для каждого стр из Объект.КодыРаспределения Цикл
		Если ЗначениеЗаполнено(Стр.КодРаспределения) тогда
			НовСтр = Набор.Добавить();
			НовСтр.Пользователь = Пользователь;
			НовСтр.ОбъектДоступа = Стр.КодРаспределения;
		КонецЕсли;
	КонецЦикла;		
	
	Для каждого Стр из Объект.Серии Цикл
		Если Стр.Доступно Тогда
			НовСтр = Набор.Добавить();
			НовСтр.Пользователь = Пользователь;
			НовСтр.ОбъектДоступа = Стр.Серия;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Стр из Объект.ТипыИнструкции Цикл
		Если Стр.Доступно Тогда
			НовСтр = Набор.Добавить();
			НовСтр.Пользователь = Пользователь;
			НовСтр.ОбъектДоступа = Стр.ТипИнструкции;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Стр из Объект.Статусы Цикл
		Если Стр.Доступно Тогда
			НовСтр = Набор.Добавить();
			НовСтр.Пользователь = Пользователь;
			НовСтр.ОбъектДоступа = Стр.Статус;
		КонецЕсли;
	КонецЦикла;
	
	Набор.Записать();
	
	//
	ИА_ОбщиеПроцедуры_Технология_Сервер.ОбновитьДоступныеИнструкцииПользователя(Пользователь, Объект.КодыРаспределения.Выгрузить().ВыгрузитьКолонку("КодРаспределения"), Администратор);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ПользовательПриИзмененииНаСервере();
	Модифицированность = Ложь;
	ОбновитьДоступностьТаблиц();
КонецПроцедуры

&НаСервере
Процедура ПользовательПриИзмененииНаСервере()
	
	//
	Администратор = Ложь;
	
	Объект.КодыРаспределения.Очистить();
	//
	Объект.Серии.Очистить();
	выб = Справочники.ИА_Серии.Выбрать();
	Пока Выб.Следующий() Цикл
		Новст = Объект.Серии.Добавить();
		Новст.Серия = Выб.Ссылка;
	КонецЦикла;
	//
	Объект.ТипыИнструкции.Очистить();
	выб = Справочники.ИА_ТипыИнструкций.Выбрать();
	Пока Выб.Следующий() Цикл
		Новст = Объект.ТипыИнструкции.Добавить();
		Новст.ТипИнструкции = Выб.Ссылка;
	КонецЦикла;
	//
	Объект.Статусы.Очистить();
	Новстр = Объект.Статусы.Добавить();
	Новстр.Статус = Перечисления.ИА_СтатусИнструкции.Действует;
	Новстр = Объект.Статусы.Добавить();
	Новстр.Статус = Перечисления.ИА_СтатусИнструкции.НаСогласовании;
	Новстр = Объект.Статусы.Добавить();
	Новстр.Статус = Перечисления.ИА_СтатусИнструкции.Проект;
	//
	Если не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат;
	КонецЕсли;
	
	набор = РегистрыСведений.ИА_УровниДоступаПользователей.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Значение = Пользователь;
	Набор.Отбор.Пользователь.Использование = Истина;
	Набор.Прочитать();
	
	Для каждого стр из Набор Цикл
		Если стр.ОбъектДоступа = Справочники.ОргСхема.ПустаяСсылка() Тогда
			Администратор = Истина;
		КонецЕсли;
		
		типЗ = ТипЗнч(стр.ОбъектДоступа);
		
		Если типЗ = Тип("СправочникСсылка.ОргСхема") и ЗначениеЗаполнено(стр.ОбъектДоступа) Тогда
			Новстр = Объект.КодыРаспределения.Добавить();
			Новстр.КодРаспределения = стр.ОбъектДоступа;
		КонецЕсли;
		
		Если типЗ = Тип("СправочникСсылка.ИА_Серии") Тогда
			Парам = Новый Структура("Серия",стр.ОбъектДоступа);
			стр1 = Объект.Серии.НайтиСтроки(Парам);
			стр1[0].Доступно = истина;
		КонецЕсли;
		
		Если типЗ = Тип("СправочникСсылка.ИА_ТипыИнструкций") Тогда
			Парам = Новый Структура("ТипИнструкции",стр.ОбъектДоступа);
			стр1 = Объект.ТипыИнструкции.НайтиСтроки(Парам);
			стр1[0].Доступно = истина;
		КонецЕсли;
		
		Если типЗ = Тип("ПеречислениеСсылка.ИА_СтатусИнструкции") Тогда
			Парам = Новый Структура("Статус",стр.ОбъектДоступа);
			стр1 = Объект.Статусы.НайтиСтроки(Парам);
			стр1[0].Доступно = истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьОкно(Команда)
	Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ЯвляетсяАдминистраторомПриИзменении(Элемент)
	Модифицированность = истина;
	ОбновитьДоступностьТаблиц();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьТаблиц()
	Элементы.КодыРаспределения.Доступность = не Администратор;
	Элементы.ТипыИнструкции.Доступность = не Администратор;
	Элементы.Серии.Доступность = не Администратор;
	Элементы.Статусы.Доступность = не Администратор;
КонецПроцедуры

&НаКлиенте
Процедура КодыРаспределенияПриИзменении(Элемент)
	Модифицированность = истина;
КонецПроцедуры


&НаКлиенте
Процедура КодыРаспределенияПослеУдаления(Элемент)
	Модифицированность = истина;
КонецПроцедуры


&НаКлиенте
Процедура СерииПриИзменении(Элемент)
	Модифицированность = истина;
КонецПроцедуры


&НаКлиенте
Процедура СерииПослеУдаления(Элемент)
	Модифицированность = истина;
КонецПроцедуры


&НаКлиенте
Процедура ТипыИнструкцииПриИзменении(Элемент)
	Модифицированность = истина;
КонецПроцедуры


&НаКлиенте
Процедура СтатусыПриИзменении(Элемент)
	Модифицированность = истина;
КонецПроцедуры


&НаКлиенте
Процедура ТипыИнструкцииПослеУдаления(Элемент)
	Модифицированность = истина;
КонецПроцедуры


&НаКлиенте
Процедура СтатусыПослеУдаления(Элемент)
	Модифицированность = истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоГруппаПольз(пСсылка)
	Попытка      
		Возврат пСсылка.ЭтоГруппа;
	Исключение
		Возврат ложь;
	КонецПопытки;
КонецФункции

&НаКлиенте
Процедура ПользователиПриАктивизацииСтроки(Элемент)
	Если ЗначениеЗаполнено(Элементы.Пользователи.ТекущаяСтрока) и не ЭтоГруппаПольз(Элементы.Пользователи.ТекущиеДанные.Ссылка) Тогда 
		Если Модифицированность Тогда
			отв = Неопределено;

			ПоказатьВопрос(Новый ОписаниеОповещения("ПользователиПриАктивизацииСтрокиЗавершение", ЭтотОбъект), "Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНет);
            Возврат;
		КонецЕсли;
		ПользователиПриАктивизацииСтрокиФрагмент();

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПользователиПриАктивизацииСтрокиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	отв = РезультатВопроса;
	Если отв = КодВозвратаДиалога.Да Тогда
		СохранитьНаСервере();
		Элементы.Пользователи.Обновить();
	КонецЕсли;
	
	ПользователиПриАктивизацииСтрокиФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ПользователиПриАктивизацииСтрокиФрагмент()
	
	Пользователь = Элементы.Пользователи.ТекущаяСтрока;
	ПользовательПриИзменении(Неопределено);

КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Модифицированность Тогда

		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), "Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);
        Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	отв = РезультатВопроса;
	Если отв = КодВозвратаДиалога.Да Тогда
		СохранитьНаСервере();
		Модифицированность = ложь;
		Закрыть();
	ИначеЕсли отв = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура УстановитьПраваГруппе(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьПраваГруппеЗавершение1", ЭтотОбъект), "Групповая установка прав устанавливает указанные права за исключением доступных постов т.к. посты указываются для каждого пользователя индивидуально. Продолжить?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПраваГруппеЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда		
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ИА_УстановкаУровнейДоступаПользователей.Форма.ФормаВыбораПользователей",,,,,, Новый ОписаниеОповещения("УстановитьПраваГруппеЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПраваГруппеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	рез = Результат;
	Если ЗначениеЗаполнено(рез) Тогда
		УстановитьПраваГруппе_Сервер(рез);
		Элементы.Пользователи.Обновить();
		Модифицированность = Ложь;
		ПоказатьПредупреждение(,"Права установлены!");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьПраваГруппе_Сервер(списокПольз)
	
	Для каждого польз из списокПольз Цикл	
		
		// сохраним доступные объекты
		набор = РегистрыСведений.ИА_УровниДоступаПользователей.СоздатьНаборЗаписей();
		Набор.Отбор.Пользователь.Значение = польз;
		Набор.Отбор.Пользователь.Использование = Истина;
		Набор.Прочитать();
		
		//посты
		ИсхДостПосты = Новый Массив;
		Для каждого стр из Набор Цикл
			Если ТипЗнч(стр.ОбъектДоступа) = Тип("СправочникСсылка.ОргСхема") И ЗначениеЗаполнено(Стр.ОбъектДоступа) Тогда
				ИсхДостПосты.Добавить(стр.ОбъектДоступа);
			КонецЕсли;
		КонецЦикла;
		
		Набор.Очистить();
		
		Если Администратор Тогда
			Новстр = Набор.Добавить();
			Новстр.Пользователь = польз;
			Новстр.ОбъектДоступа = Справочники.ОргСхема.ПустаяСсылка();
		КонецЕсли;
		
		Для каждого стрПост из ИсхДостПосты Цикл
			Новстр = Набор.Добавить();
			Новстр.Пользователь = польз;
			Новстр.ОбъектДоступа = стрПост;
		КонецЦикла;
		
		Для каждого стр из Объект.Серии Цикл
			Если стр.Доступно Тогда
				Новстр = Набор.Добавить();
				Новстр.Пользователь = польз;
				Новстр.ОбъектДоступа = стр.Серия;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого стр из Объект.ТипыИнструкции Цикл
			Если стр.Доступно Тогда
				Новстр = Набор.Добавить();
				Новстр.Пользователь = польз;
				Новстр.ОбъектДоступа = стр.ТипИнструкции;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого стр из Объект.Статусы Цикл
			Если стр.Доступно Тогда
				Новстр = Набор.Добавить();
				Новстр.Пользователь = польз;
				Новстр.ОбъектДоступа = стр.Статус;
			КонецЕсли;
		КонецЦикла;
		
		Набор.Записать();
		
		//
		ИА_ОбщиеПроцедуры_Технология_Сервер.ОбновитьДоступныеИнструкцииПользователя(польз, ИсхДостПосты, Администратор);
		
	КонецЦикла;	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ТипыИнструкции.Видимость = Константы.ИА_ДИ_КонтрольПоТипамИнструкций.Получить();
	Элементы.Серии.Видимость          = Константы.ИА_ДИ_КонтрольПоСериям.Получить();
	Элементы.Статусы.Видимость        = Константы.ИА_ДИ_КонтрольПоСтатусам.Получить();
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоОргсхеме(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоОргсхемеЗавершение", ЭтотОбъект), "Существующие данные будут перезаполнены. Продолжить?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОргсхемеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоОргсхеме_Сервер();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОргсхеме_Сервер()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	            | ОргСхема.Ссылка
	            |ИЗ
	            | Справочник.ОргСхема КАК ОргСхема";
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ИА_ОбщиеПроцедуры_Технология_Сервер.ПроверитьПраваПоста(Выборка.Ссылка);
		ИА_ОбщиеПроцедуры_Технология_Сервер.УдалитьЛишниеПраваДИ(Выборка.Ссылка);
	КонецЦикла; 
      
КонецПроцедуры
